In [4]:
%matplotlib inline
import pandas as pd

In [5]:
'''from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))'''

"from IPython.core.display import HTML\ncss = open('style-table.css').read() + open('style-notebook.css').read()\nHTML('<style>{}</style>'.format(css))"

In [7]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [8]:
len(titles)

244914

### What are the earliest two films listed in the titles dataframe?

In [9]:
titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [10]:
len(titles[titles.title=='Hamlet'])

20

### How many movies are titled "North by Northwest"?

In [11]:

len(titles[titles.title=='North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [12]:
titles[titles.title=='Hamlet'].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [13]:
titles[titles.title=='Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [14]:
len(titles[titles.year==1950])

1113

### How many movies were made in the year 1960?

In [15]:
len(titles[titles.year==1960])

1549

### How many movies were made from 1950 through 1959?

In [17]:
t = titles
len(t[(1950<=t.year)&(t.year<=1959)])

12934

### In what years has a movie titled "Batman" been released?

In [18]:
titles[titles.title=='Batman'].sort_values('year')

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [19]:
titles[titles.title=='Inception'].sort_values('year')

            title  year
183910  Inception  2010

In [20]:
t = t[t.title == 'Inception']
t = t[t.isnull()]
len(t)

1

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [21]:
t = t[t.title == 'Inception']
t = t[t.notnull()]
len(t)

0

### But how many roles in the movie "Inception" did receive an "n" value?

In [22]:
t = t[t.title == 'Inception']
t = t[t.isnull()]
len(t)

0

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [25]:
t = t[t.title == 'North by Northwest']
t = t[t.isnull()]
len(t)

0

In [26]:
titles[titles.title=='North by Northwest'].sort_values('year')

                    title  year
74398  North by Northwest  1959

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [27]:
titles[titles.title=='Sleuth'].sort_values('year')

         title  year
79273   Sleuth  1972
205128  Sleuth  2007

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

### How many roles were credited in Branaghâ€™s 1996 Hamlet?